In [1]:
# 01.Loading & examining our data.py
# Import pandas 
import pandas as pd

In [3]:
# Load the customer_data
customer_data = pd.read_csv("data/user_demographics_v1.csv") # customer_data.csv

# Load the app_purchases
app_purchases = pd.read_csv("data/purchase_data_v1.csv") # inapp_purchases.csv

# Print the columns of customer data
print(customer_data.columns)

# Print the columns of app_purchases
print(app_purchases.columns)

Index(['uid', 'reg_date', 'device', 'gender', 'country', 'age'], dtype='object')
Index(['date', 'uid', 'sku', 'price'], dtype='object')

In [8]:
customer_data.head(1)

          uid              reg_date device gender country  age
0  54030035.0  2017-06-29T00:00:00Z    and      M     USA   19

In [13]:
import datetime as dt

In [39]:
customer_data['date']= pd.to_datetime(customer_data['reg_date'], format='%Y-%m-%d').dt.date

In [48]:
customer_data['uid'] = customer_data['uid'].astype(int)

In [49]:
customer_data

           uid              reg_date device gender country  age        date
0     54030035  2017-06-29T00:00:00Z    and      M     USA   19  2017-06-29
1     72574201  2018-03-05T00:00:00Z    iOS      F     TUR   22  2018-03-05
2     64187558  2016-02-07T00:00:00Z    iOS      M     USA   16  2016-02-07
3     92513925  2017-05-25T00:00:00Z    and      M     BRA   41  2017-05-25
4     99231338  2017-03-26T00:00:00Z    iOS      M     FRA   59  2017-03-26
...        ...                   ...    ...    ...     ...  ...         ...
9995  43138741  2016-11-23T00:00:00Z    and      M     BRA   16  2016-11-23
9996  30326568  2016-08-21T00:00:00Z    and      M     BRA   15  2016-08-21
9997  92384369  2015-08-20T00:00:00Z    and      F     DEU   33  2015-08-20
9998  98809962  2017-04-08T00:00:00Z    iOS      F     FRA   32  2017-04-08
9999  82078268  2018-02-23T00:00:00Z    and      F     CAN   31  2018-02-23

[10000 rows x 7 columns]

In [50]:
customer_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 7 columns):
uid         10000 non-null int64
reg_date    10000 non-null object
device      10000 non-null object
gender      10000 non-null object
country     10000 non-null object
age         10000 non-null int64
date        10000 non-null object
dtypes: int64(2), object(5)
memory usage: 547.0+ KB

In [51]:
app_purchases

            date       uid             sku  price
0     2017-07-10  41195147   sku_three_499    499
1     2017-07-15  41195147   sku_three_499    499
2     2017-11-12  41195147    sku_four_599    599
3     2017-09-26  91591874     sku_two_299    299
4     2017-12-01  91591874    sku_four_599    599
...          ...       ...             ...    ...
9001  2017-02-06  16377492   sku_three_499    499
9002  2017-03-01  16377492  sku_seven_1499    499
9003  2017-05-29  92513925     sku_two_299    299
9004  2017-08-23  92513925    sku_four_599    599
9005  2018-03-26  92513925    sku_six_1299    299

[9006 rows x 4 columns]

In [52]:
app_purchases.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9006 entries, 0 to 9005
Data columns (total 4 columns):
date     9006 non-null object
uid      9006 non-null int64
sku      9006 non-null object
price    9006 non-null int64
dtypes: int64(2), object(2)
memory usage: 281.6+ KB

In [53]:
# %load 02_Merging on different sets of fields.py
# 02_Merging on different sets of fields.py
# Merge on the 'uid' and 'date' field
uid_date_combined_data = app_purchases.merge(customer_data, on=['uid','date'], how='inner')

# Examine the results 
print(uid_date_combined_data.head())
print(len(uid_date_combined_data))

Empty DataFrame
Columns: [date, uid, sku, price, reg_date, device, gender, country, age]
Index: []
0